Documents/ЗаказОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>ЗаказОборудования</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Оборудованире</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Цены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>Цены</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Оборудованире</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЗаказОборудования/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура НоменклатураЦенаПриИзменении(Элемент)
	СТЧ=Элементы.Номенклатура.ТекущиеДанные;
	СТЧ.Сумма = СТЧ.Количество * СТЧ.Цена;
КонецПроцедуры      
             
&НаКлиенте

Процедура НоменклатураКоличествоПриИзменении(Элемент)
	СТЧ=Элементы.Номенклатура.ТекущиеДанные;
	СТЧ.Сумма = СТЧ.Количество * СТЧ.Цена;
КонецПроцедуры
&НаКлиенте
Процедура НоменклатураНаименованиеПриИзменении(Элемент)
СтрокаРасчета = Элементы.Номенклатура.ТекущиеДанные;
СтрокаРасчета.Цена = ПолучитьЦену(СтрокаРасчета.Наименование);
НоменклатураЦенаПриИзменении(Элемент);
КонецПроцедуры                 

        &НаСервере
		функция ПолучитьЦену (НаименованиеДокумента)
			СтруктураОтбора = Новый Структура;   
			СтруктураОтбора.Вставить("Наименование", НаименованиеДокумента);
			РезультатОтбора = РегистрыСведений.Цены.Получить(СтруктураОтбора);
          Возврат РезультатОтбора.Цена;
	  КонецФункции
